# Terminal
cask "ghostty"
brew "tmux"
brew "starship"
brew "zoxide"

# Editor
brew "neovim"

# Window management
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

# Status bar
brew "FelixKratz/formulae/sketchybar"

# Borders
brew "FelixKratz/formulae/borders"

# Development tools
brew "lazygit"
brew "btop"
brew "nnn"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"
brew "fzf"
brew "git-delta"

# Karabiner
cask "karabiner-elements"

# Fonts
cask "font-sf-pro"
cask "font-sf-mono"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Media
brew "nowplaying-cli"
brew "switchaudio-osx"
